app/controllers/emails_controller.rb

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", true], ["updated_at", "2021-06-03 14:56:33.506044"], ["id", 9]]
---
    def show
      @page_title = 'Lire le mail'
      @email = Email.find(params[:id])
      @email.update(read: true)

SELECT "emails".* FROM "emails"
---
    def index
      @page_title = 'Boite de réception'
      @emails = Email.all.sort_by(&:created_at).reverse