app/models/email.rb

INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
    def self.create_fake
      Email.create(
        object: Faker::TvShows::Suits.quote,
        body: Faker::Movies::PrincessBride.quote,
        read: false
      )